cfg/InformationRegisters/ФИОФизЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ФИОФизЛиц</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фамилия</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cfg/InformationRegisters/ФИОФизЛиц/Forms/ФормаСписка/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

Процедура РегистрСведенийСписокПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Ссылка = Справочники.ФизическиеЛица.ПустаяСсылка();
	Если ЭлементыФормы.РегистрСведенийСписок.ТекущиеДанные <> Неопределено Тогда
		Ссылка = ЭлементыФормы.РегистрСведенийСписок.ТекущиеДанные.ФизЛицо	
	КонецЕсли;
	Оповестить("ОбновитьФорму", Новый Структура("ИмяЭлемента","ФИО"),Ссылка);

КонецПроцедуры

Процедура РегистрСведенийСписокПослеУдаления(Элемент)

	Ссылка = Справочники.ФизическиеЛица.ПустаяСсылка();
	Если Отбор.ФизЛицо.Использование Тогда
		Ссылка = Отбор.ФизЛицо.Значение
	КонецЕсли;
	Оповестить("ОбновитьФорму", Новый Структура("ИмяЭлемента","ФИО"), Ссылка);

КонецПроцедуры

Процедура РегистрСведенийСписокПериодПриИзменении(Элемент)
	Если Элемент.Значение > РабочаяДата Тогда
		Ответ = Вопрос(НСтр("ru='Вы действительно хотите ввести фамилию,';uk='Ви дійсно хочете ввести прізвище,'") + Символы.ПС + НСтр("ru='имя и отчество физлица на будущую дату?';uk=""ім'я та по батькові фізособи на майбутню дату?"""), РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Элемент.Значение = РабочаяДата
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
